// ============================
// ДОБАВЛЕНИЕ МАРКЕРОВ
// ============================

// Лагеря у дороги
addMarker(3266,2036, 'Лагерь у дороги', 'Лагерь', "Лагеря у дороги");
addMarker(2914,3064, 'Лагерь у дороги', 'Лагерь', "Лагеря у дороги");
addMarker(3462,3982, 'Лагерь у дороги', 'Лагерь', "Лагеря у дороги");
addMarker(3252,5012, 'Лагерь у дороги', 'Лагерь', "Лагеря у дороги");
addMarker(4840,4488, 'Лагерь у дороги', 'Лагерь', "Лагеря у дороги");
addMarker(5336,5492, 'Лагерь у дороги', 'Лагерь', "Лагеря у дороги");
addMarker(5894,6786, 'Лагерь у дороги', 'Лагерь', "Лагеря у дороги");
addMarker(5398,7138, 'Лагерь у дороги', 'Лагерь', "Лагеря у дороги");
addMarker(9008,6580, 'Лагерь у дороги', 'Лагерь', "Лагеря у дороги");
addMarker(6432,4892, 'Лагерь у дороги', 'Лагерь', "Лагеря у дороги");
addMarker(6832,3356, 'Лагерь у дороги', 'Лагерь', "Лагеря у дороги");
addMarker(9256,3668, 'Лагерь у дороги', 'Лагерь', "Лагеря у дороги");
addMarker(9924,2990, 'Лагерь у дороги', 'Лагерь', "Лагеря у дороги");

// Поселения
addMarker(9670, 4462, "Кутна-Гора", "Центральный город, также называемый столицей серебряных рудников", "Поселения");
addMarker(2144, 4466, "Сухдол", "Поселение с небольшой крепостью на западе карты", "Поселения");
addMarker(2818, 2142, "Раборш", "Небольшая деревня с крепостью", "Поселения");
addMarker(3978, 2098, "Богуновиц", "Небольшая деревня", "Поселения");
addMarker(4460, 2946, "Опатовиц", "Небольшая деревня у лагеря Сигизмунда", "Поселения");
addMarker(6072, 2392, "Хоршан", "Небольшая деревня у Логова черта", "Поселения");
addMarker(7608, 2032, "Грунд", "Деревня горняков", "Поселения");
addMarker(6894, 4032, "Пщитоки", "Небольшая деревня", "Поселения");
addMarker(5490, 4958, "Мисковиц", "Небольшая деревня с прудом, известная подпольными боями", "Поселения");
addMarker(7162, 6092, "Билани", "Небольшая деревня", "Поселения");
addMarker(6416, 8972, "Малешов", "Деревня с крепостью пана Отто Бергова", "Поселения");
addMarker(3072, 5908, "Bисока", "Небольшая деревня", "Поселения");

// Основные квесты
addMarker(2252, 4272, "Помяни Черта", "Отправиться на поиски Черта вместе с Жижкой", "Основные квесты");
addMarker(2246, 4080, "Пером и мечом", "Доложить Маркграфу Йобсту о событиях в Тросках", "Основные квесты");
addMarker(2244, 4130, "Последние обряды", "Отразить атаку на крепость", "Основные квесты");
addMarker(6109, 1495, "Чертова стая", "Привести членов банды Черта в Логово черта", "Основные квесты");
addMarker(6131, 1486, "В подземелье", "Узнать информацию о Лихтенштейне от Катерины", "Основные квесты");

// Побочные квесты
addMarker(7715, 2185, 'Что-то сгнило', 'Завершите задания «Наконечник стрелы» и «Волшебная стрела», затем подождите несколько дней, прежде чем поговорить с трактирщиком.',
    'Побочные квесты');
addMarker(6969, 1709, 'Наконечник стрелы', 'Согласиться помочь человеку со стрелой в голове', 'Побочные квесты');
addMarker(6152, 1456, 'Волшебная стрела', 'Поговорить с Пашей после выполнения задания «Наконечник стрелы»', 'Побочные квесты');
addMarker(6083, 1541, 'Боевая подгтовка II', 'Cпросить у Сухого Черта о его самочувствии после задания «Помяни Черта»', 'Побочные квесты');
addMarker(7615, 2147, 'Громовой камень', 'Поговорить с Коной', 'Побочные квесты');
addMarker(8636, 3672, 'Пасть Дьявола', 'Поговорить с Владимиром и Отцом Марианом', 'Побочные квесты');
addMarker(9698, 4232, 'Ars Dimicatoria', 'Согласиться на состязание с оружейником', 'Побочные квесты');
addMarker(9301, 4443, 'In Vino Veritas', 'Поговорить с Рудольфом Каспером', 'Побочные квесты');
addMarker(9907, 4552, 'Пятый комендант', 'Поговорить с Катериной', 'Побочные квесты');
addMarker(9281, 4640, 'Пьяницы и мода', 'Поговорить с бригадиром Влахом', 'Побочные квесты');
addMarker(10291, 4743, 'Пир для нищих', 'Поговорить с Чеником после задания «В подземелье»', 'Побочные квесты');
addMarker(10064, 4935, 'Хорошая баня', 'Поговорить с хозяйкой купален Бэти', 'Побочные квесты');
addMarker(10082, 4938, 'Дурная Репутация', 'Поговорить с хозяйкой купален Бэти после выполнения задания «Хорошая баня»', 'Побочные квесты')
addMarker(8509, 4432, 'Выкуп', 'Поговорить с Яном Сухотским', 'Побочные квесты');
addMarker(7210,6125, 'Логово Дракона', 'Поговорить со священником Славой', 'Побочные квесты');
addMarker(6000, 6240, 'Наследие', 'Прийти к дому лесничего', 'Побочные квесты');
addMarker(3025, 6009, 'Все по правилам', 'Поговорить с наемником Павелом', 'Побочные квесты');
addMarker(5559, 5029, 'Тише, моя дорогая', 'Поговорить с женой кузнеца Мартой', 'Побочные квесты');
addMarker(10929, 3195, 'Ты - прах', 'Поговорить с братом Мортериусом', 'Побочные квесты');
// Мастерские бронника
addMarker(9400,4400,'Мастерская бронника','Магазин брони на въезде в Кутна-Гору','Мастерские бронника')
addMarker(9920,4404,'Мастерская бронника','Магазин брони в Кутна-Горе','Мастерские бронника')
addMarker(9823,4260,'Мастерская бронника','Магазин брони в Кутна-Горе','Мастерские бронника')
addMarker(9717,4274,'Мастерская бронника','Магазин брони в Кутна-Горе','Мастерские бронника')
addMarker(9805,4500,'Мастерская бронника','Магазин брони в Кутна-Горе','Мастерские бронника')
addMarker(4485,3590,'Мастерская бронника','Магазин брони в Кутна-Горе','Мастерские бронника')
addMarker(9720,4200,'Мастерская бронника','Магазин брони в Кутна-Горе','Мастерские бронника')

// Таверны
addMarker(5430,4900,'Таверна','Таверна в Мисковице','Таверны')
addMarker(2183,4480,"Таверна","Таверна в Сухдоле","Таверны")
addMarker(6090,1425,"Таверна","Таверна в Чертовом Логове","Таверны")
addMarker(7690,2167,"Таверна","Таверна в Грунде","Таверны")
addMarker(7110,4670,"Таверна","Таверна по дороге в Кутна-Гору","Таверны")
addMarker(9189,4594,"Таверна","Таверна около конюшни","Таверны")
addMarker(9270,4581,"Таверна","Таверна на въезде в Кутна-Гору","Таверны")
addMarker(9626,4592,"Таверна","Таверна перед площадью в Кутна-Горе","Таверны")
addMarker(9828,4280,"Таверна","Таверна на севере Кутна-Горы","Таверны")
addMarker(9420,4296,"Таверна","Таверна около магазина брони в Кутна-Горе","Таверны")
addMarker(9706,4099,"Таверна","Таверна на севере Кутна-Горы","Таверны")
addMarker(6610,8923,"Таверна","Таверное Малешов","Таверны")
addMarker(7168,5964,"Таверна","Таверна в деревне Билани","Таверны")

// Просьбы
addMarker(5060,5340,'Крестьянское восстание','Как начать: Поговорите с травницей Властой','Просьбы')
addMarker(9800,3728,"Под соломенной шляпой","Как начать: поговорите с рекрутером","Просьбы")
addMarker(9500,4266,"Отражение зла","Как начать: поговорите с Иоганном Парлером","Просьбы")
addMarker(9860,4267,"Высокий налог","Как начать: Поговорите с Корчмарем Францом Гельстуком","Просьбы")
addMarker(9316,4707,"Игрушки мастера Шинделя","Как начать: Поговорите с Адамом о Goatskin во время главного квеста ","Просьбы")
addMarker(10304,4728,"Кодекс Воров","Как начать: Завершите фаст побочного квеста для бедных","Просьбы")
addMarker(10317,4735,"Гражданская обязанность","","Просьбы")
addMarker(10300,4745,"За пределами могилы","Как начать: Поговорите с крысой после завершения побочных квестов Feast для бедных","Просьбы")
addMarker(10314,4745,"Немецкое сокровище","Как начать: Поговорите с Крысой после выполнения задачи За могилой","Просьбы")
addMarker(10310,4764,"Зубы в мешке","Как начать: Поговорите с Корчмарем Моулом о боях","Просьбы")
addMarker(10303,4779,"Гвоздь в гробу","Как начать: Завершите задание зубы в сумке","Просьбы")
addMarker(10338,2518,"Реликварий","Как начать: Поговорите со Скромным Рыцарем","Просьбы")
addMarker(6800,4150,"X Знак пятна","Как начать: Поговорите с наемным рукой Крижан и приобретите карту сокровищ","Просьбы")
addMarker(5446,4910,"Хватит!","Как начать: Поговорите с внутренником Здеславом о боях","Просьбы")
addMarker(5560,5030,"Коллекционер","Как начать: Поговорите с Бэйлифом Круксом о награде","Просьбы")
addMarker(7530,7371,"Скелет в шкафу","Как начать: Поговорите с Яном Пози из Зимбурга после завершения побочных квестов Bellatores","Просьбы")
addMarker(4460,3654,"Абсолвер","Как начать: Поговорите с Томасом из Колин","Просьбы")
addMarker(2275,4047,"В поисках справедливости","Как начать: Поговорите с капитаном Френцлом о вору после завершения побочных квестов Все ярмарки...","Просьбы")
addMarker(2280,4080,"Белый Робак","Как начать: Поговорите с Huntsman Доброш Пекер о белом хареке","Просьбы")
addMarker(2100,4562,"Примум Нил Носер","Как начать: Поговорите с Младой во время побочных квестов Шторм","Просьбы")
addMarker(3040,5820,"Паломничество","Как начать: Поговорите с отцом Энтони об одобрении репутации","Просьбы")
addMarker(7500,1922,"Молоток и щипцы","Как начать: Поговорите с кузнецом Здимиром о своем ученике","Просьбы")
addMarker(6940,1706,"Наконечник стрелы","Как начать: поговорите с Карел Эрроухед","Просьбы")
addMarker(6042,2492,"Грязный бой","Как начать: Поговорите с Томлином Брутансом о боях","Просьбы")
addMarker(6000,2495,"Момент славы","Как начать: Поговорите с Тобиасом «Дарлингом» после выполнения задачи Грязный бой","Просьбы")
addMarker(4650,6090,'Кузница','Кузница в деревне','Кузницы')

// Кузницы
addMarker(4650, 6090, 'Кузница', 'Кузница в деревне', 'Кузницы');
addMarker(10260, 4987, 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(9650, 4929, 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(9164,4861, 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(9224,4533, 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(9413,4350, 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(9572,4374, 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(9674,4274 , 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(9712, 4250, 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(9715,4140 , 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(9848  ,4242 , 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(9794, 4558 , 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(9998, 4384, 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(7140, 2488, 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(7512, 1936, 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(6099, 1431, 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(4392, 3490, 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(4398, 3483, 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(4462, 3576, 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(2304, 3968, 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(2251, 4372, 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(5590,5036 , 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(5602, 5036, 'Кузница', 'Кузница в Кутенберге', 'Кузницы');
addMarker(5736, 8450, 'Кузница', 'Кузница в Кутенберге', 'Кузницы');

// Функция для быстрого добавления маркера
function addMarkers(pixelX, pixelY, title, description, iconUrl = null) {
    return addMarker(pixelX, pixelY, title, description, 'default', iconUrl);
}